
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiHaba/aws-ecs-terraform/actions/runs/10320530730)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d3bc6321415261f2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e85ff5b730879868]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0094ede6f5e9b43a2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c861b2c5fa1a1383]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d739af6509c77909]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0539410e12d384fea]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-013e3158ba1d87cb8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bbc16a37d4945990]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-051818b3ca2c1050c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d723ee54653a8d31]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0be0afc03eb19635a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a24704fbcf978b51]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0094ede6f5e9b43a21080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02dc7c60bbde05715]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08d01b6dbc301047e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae73b39760ada660]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02b5f438bd818005a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-014f5e9d65c806c81]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f94a0ef2185be8f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-068c3b626f7c89750]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d3652fd8c583d1bc]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d739af6509c779091080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e85ff5b7308798681080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "ALB Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0d3bc6321415261f2"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "ECS Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0d3bc6321415261f2"
    }

  # aws_security_group_rule.alb_to_ecs will be created
  + resource "aws_security_group_rule" "alb_to_ecs" {
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 5s [id=sg-085b65b04939915ca]
aws_security_group.alb: Creation complete after 5s [id=sg-0dc0aa69fd5dd1046]
aws_security_group_rule.alb_to_ecs: Creating...
aws_security_group_rule.alb_to_ecs: Creation complete after 1s [id=sgrule-1428484681]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"8c958002d6c1a8a12a5ce98fb583c3037024f7e8","Vars":{},"WorkflowName":"Terraform CI/CD"} -->